const sim1 = {
      "Анастасия Резникова": 74155434543,
      "Петр Голованин": 74876543213,
      "Сергей Усс": 7487894363,
      "Илья Прокофьев": 74876576217
}

const phoneBook = {
    "Анастасия Резникова": 7465534543,
    "Петр Голованин": 74876543213,
    "Сергей Усс": 7487894363,
    "Илья Прокофьев": 74876576217,
    "Василий Пупкин": 74876576453,
    "Андрей Петров": 74876576865,
    "Денис Сафонов": 74876576143,
    "Илья Резников": 74876576778,
}

const cloudContacts = {
    "Сергей Антонов": 7487894231,
    "Илья Понамарев": 74856776217,
    "Василий Шишкин": 74856646453,
    "Андрей Афанасьев": 74873546865,
    "Денис Верещягин": 74876546143,
    "Илья Кива": 74875677778,
}

const all = {}
for(const key in phoneBook) {
  all[key] = phoneBook[key]
}
console.log(all)

Object.assign(sim1, phoneBook, cloudContacts);

console.log(sim1)

